ask_food_cn = ["宮保雞丁", "麻婆豆腐", "紅燒肉", "魚香茄子", "回鍋肉", "麻辣火鍋", "葱爆羊肉", "京醬肉絲", "醋溜白菜", "干煸豆角", 
               "梅菜扣肉", "蒜泥白肉", "鮮蝦炒飯", "酸菜魚", "水煮魚", "鹹酥雞", "乾燒蝦仁", "糖醋里脊", "鐵板牛柳", "炒麵", "番茄炒蛋", 
               "清蒸魚", "紅燒排骨", "小炒肉", "蛋炒飯", "蒸蛋", "紅燒鯉魚", "家常豆腐", "糯米雞", "口水雞", "韭菜盒子", "燉雞湯", "麻油雞", 
               "豬肉餅", "三杯雞", "蛋糕", "蒸餃子", "魚香肉絲", "豉椒蒸魚", "清蒸蝦", "蒜蓉蒸扇貝", "麻辣牛肉", "五香牛肉", "紅燒牛肉面", 
               "香菇炒肉片", "鮮蝦炒麵", "辣子雞", "酸辣湯", "芹菜炒肉絲", "麻婆茄子", "青椒肉絲", "蚵仔煎", "蔥油餅", "鹽水雞", "蝦仁炒蛋", 
               "蔥爆羊肉", "紅燒牛肉", "冬瓜排骨湯", "炸薯條", "香菇雞湯", "菜脯蛋", "鮮蝦雲吞麵", "炸彈蝦", "酸菜牛肉麵", "鐵板燒", "糖醋蝦", 
               "炒蟹粉蛋", "沙茶醬牛肉", "蝦仁炒飯", "豆腐脆皮燒賣", "清炒芥蘭", "椒鹽魷魚", "薑汁煮鴨腱", "宜蘭蔥油餅", "龍井蝦仁", 
               "金沙炸蝦球", "蒜茸蒸大明蝦", "清蒸海斑", "芙蓉蛋", "咖哩牛腩", "燜煮牛肉", "西紅柿炒蛋", "香辣蟹", "芥菜心炒肉絲", 
               "香脆花枝丸", "麥芽糖燒叉燒", "豆鼓肉絲", "清蒸魚頭", "紅油肚絲", "泰式綠咖哩牛肉", "蔥花爆蝦", "薑蔥炒龍利球", "咖哩雞飯", 
               "酸辣土豆絲", "油麥菜炒蛋", "糯米雞腿", "羊肉泡麵", "豉汁蒸排骨", "醉雞腳", "蝦仁肉末豆腐", "蝦仁炒年糕", "台式炸雞排", 
               "鹹蛋黃蝦仁炒飯", "蝦醬鴨蛋", "肉末蒸蛋", "蠔油西蘭花", "家常炒麵", "雪菜肉絲麵線湯", "麻辣口水雞", "蘑菇炒雞片", "醬燒茄子", 
               "沙茶牛肉麵", "蘿蔔糕", "奶油蟹", "椒鹽豆腐", "椰汁香蕉糯米糍", "荷葉粉蒸肉", "青椒蛋炒飯", "乾煸四季豆", "奶皇鳳爪", 
               "紅燒蹄筋", "薑絲蒸肉", "牛肉炒河粉", "台式蚵仔煎", "香菇炆雞翅"]
print("ask_food_cn: ", len(ask_food_cn))

ask_food_kr = ["泡菜炒飯", "韓式炸雞", "海鮮豆腐鍋", "辣炒年糕", "石鍋拌飯", "韓式烤肉", "炒年糕", "韓式冷麵", "醬燒排骨", "韓式泡菜湯", 
               "韓式烤牛肉", "炸烤肉捲", "海鮮煎餅", "紫菜包飯", "香辣炒雞", "韓式炸豬排", "韓式雞肉串", "醬燒雞翅", "韓式麵條", "辣炒花枝", 
               "韓式醬牛肉", "韓式炒年糕", "醋泡白菜", "蔥油拌麵", "韓式蒸餃", "韓式炒牛肉", "紅豆糯米糍", "炸豆腐", "辣炒雞肉", "韓式海鮮煲", 
               "韓式炒粉絲", "燉牛肉", "韓式蔬菜煎餅", "韓式糯米雞", "韓式肉骨茶", "韓式蒜泥白肉", "辣炒豬肉", "韓式鰻魚飯", "韓式冷麵湯", 
               "醬燒豬肉", "海鮮炒年糕", "韓式大餅", "韓式糖醋雞", "辣炒牛肉", "豆芽拌飯", "石鍋拌麵", "韓式餃子湯", "韓式海鮮煎餅", "韓式炒飯饅頭", 
               "韓式煎餃子", "炒年糕餅", "韓式辣炒蝦", "韓式冬蔭功湯", "韓式蜜汁雞翅", "韓式香腸", "辣炒豆腐", "韓式紫菜湯", "韓式煎魚", "炒年糕條"]
ask_food_kr += ["韓式炸蝦", "炒鳳尾魚", "韓式辣炒螃蟹", "韓式冷麵湯面", "豆腐蔬菜煲", "韓式春捲", "韓式炸鮮魚", "韓式大酱湯", "韓式香饼", 
                "韓式蒜蓉菜花", "韓式甜辣肉丸", "韓式花甲粉絲", "韓式泡菜拌飯", "石鍋拌飯卷", "韓式炸雞中翅", "韓式辣炒蛤蜊", "韓式炸雞腿", 
                "韓式炸雞排", "炒辣猪肉絲", "韓式炸雞翅", "韓式辣炒猪肝", "韓式咖喱牛肉", "韓式豆腐湯", "韓式紫菜包飯", "炒韭菜", "韓式炒年糕糍", 
                "韓式冷面拌菜", "韓式炸魚片", "炒紫菜蛋飯", "韓式豆腐煲", "韓式鐵板烤肉", "炒辣雞肉片", "韓式辣炒墨魚", "韓式雞肉炒飯", "韓式炒年糕片", 
                "韓式糯米糍", "韓式鐵板飯", "炒豆芽飯", "韓式辣炒鴨肉", "韓式牛肉粉絲湯", "韓式炒豆腐絲", "韓式海鮮豆腐鍋", "韓式蛋包飯", "韓式鍋包肉", "韓式炸虾饼", "韓式炸雞串", "韓式豆腐飯", "炒豆腐片", "韓式豆腐花湯", "韓式拌面", "韓式炸雞皮", "韓式腰果"]
print("ask_food_kr: ", len(ask_food_kr))

ask_food_jp = ['花田妃路', '三杯雞', '三文魚刺身', '三文魚壽司', '丸子', '九州煮', '井之頭豆腐', '冷素麵', '凍豆腐', '北極貝刺身',
                '卡拉奇', '味增湯', '味噌拉麵', '和風漬物', '嘉魚', '土瓶蒸', '壽司', '天婦羅', '天婦羅烏冬麵', '天婦羅蝦',
                '大阪燒', '天津飯', '奶油豬肉咖哩', '孜然燒肉', '宮崎燒雞', '小籠包', '山葵醬汁生蠔', '岩燒烤牛肉', '干貝壽司',
                '廣島燒', '手握壽司', '手擀烏冬', '拉麵', '拌冷麵', '拌豆腐', '拌麵', '日式炒麵', '日式涼麵', '日式薄餅',
                '日式鐵板燒', '日本咖哩', '日式豆腐湯', '日式鰻魚飯', '普羅旺斯蛤蠣', '梅乃漬', '梅干', '梅花鹿肉', '梅花鮭魚',
                '棒棒腿', '海苔', '海鮮拉麵', '海鮮豆腐湯', '海鮮雜炊', '湯圓', '滷肉飯', '漁夫之菜', '濃厚拉麵', '濃厚味噌湯',
                '烏冬湯', '炙燒金槍魚', '炒飯', '炸蝦天婦羅', '煮干貝', '煮豆腐', '煮蝦', '牛肉壽司', '牛肉湯', '牛肉燒麵',
                '瓦鍋', '甜不辣', '碳烤鯖魚', '竹輪', '粉蒸肉', '紫菜', '丼飯', '關東煮', '梅子', '蒲燒鰻魚', '赤飯', '烏冬麵'
                '玉子燒', '鰻魚丼飯', '鹽燒鯖魚']
print("ask_food_kr: ", len(ask_food_kr))

ask_food_sea = ['綠咖哩雞','紅咖哩牛肉','咖哩蝦','冬蔭功湯','泰式涼拌豬皮','椰汁糯米飯','香茅雞','泰式炒河粉','咖喱魚頭','泰式椰奶燉牛肉','炒泰國冬粉',
                '青咖哩綜合蔬菜','泰式涼拌花枝','紅咖哩綜合蔬菜','泰式椰奶咖哩雞','辣味涼拌海蜇皮','泰式酸辣湯','香茅牛肉','泰式椰汁燴鴨','冬粉蒸蝦','泰式炒河蝦',
                '泰式涼拌芽菜','綠咖哩綜合蔬菜','泰式椰奶燴魚','冬粉蒸魚','香蕉葉糯米飯','泰式涼拌豬肝','泰式炸春捲','椰汁燴果仁飯','青咖哩豬肉','泰式椰汁燴雞',
                '魚露涼拌生菜','泰式椰汁燴魚頭','泰式炒粉絲', '紅咖哩燉牛腩','椰汁燴杏仁飯','泰式涼拌蕃茄','泰式炸蝦餅','香茅豬肉','泰式涼拌香菇','泰式椰汁燴豬腳',
                '泰式炒年糕','泰式椰汁燴豬肉','紅咖哩燉雞','泰式涼拌生蠔','泰式椰汁燴海鮮','泰式涼拌花生']
ask_food_sea += ['印尼燉牛肉','咖哩蚌肉','檳城阿嬤咖哩魚頭','印尼炒飯','新加坡辣椒蟹','炒花枝丸','馬來炒貓山王','峇峇羅惹','馬來咖哩燉羊肉','印尼沙爹','峇峇炒米粉',
                '新加坡咖哩雞飯','印尼燉豬蹄筋','麻油雞','馬來咖哩肉骨茶','印尼炒糯米飯','星洲炒米粉','泰式椰漿燉南瓜','馬來炒麵','星洲肉骨茶','印尼燉牛尾','峇峇咖哩雞',
                '炸猪皮','印尼炒麵','新加坡肉骨茶拉麵','泰式冬蔭功粉','檳城白咖哩','馬來糖水','星洲炸蝦','泰式香蕉煎餅','星洲黑胡椒蟹','峇峇咖哩','印尼炒年糕','印尼燉鱷魚肉',
                '新加坡叻沙','泰式椰汁燉蛋','星洲叉燒飯','峇峇炒河粉','印尼炒飯麵','泰式炒蝦仁','印尼燉椰子雞','星洲椰漿飯','泰式炸魚餅','馬來咖哩燉豬肝','星洲炸豆腐',
                '印尼咖哩魚丸湯','泰式芒果糯米飯','印尼炸雞']
print("ask_food_sea: ", len(ask_food_sea))

eat_cn = ['一點心','文華酒店 - 君臨天下','添好運','龍門客棧','紫荊閣','富臨皇宮','蟲洞食館','鴻星海鮮酒家','凱悅軒','西環餃子皇','鮨一刻 Sushi Ichi','鼎泰豐','帝苑酒家','榮記粥麵專家',
        '恆香老餅家','金麗添','龍皇酒家','楊記小菜','潮州菜馆','阿婆私房菜','銀龍冰室','泰昌餅家','鴻福堂','滿福樓','龍洞堡火鍋','名門金阁','蓮香樓','四季煲仔飯','開心果冰室',
        '大喜屋','蘭芳園','魚翅酒家','望月樓','點都德','喜記','紅蜻蜓','唐人館','世界大同','點點心','龍門飯店','鴻禧燒臘飯店','尚品廣場','金華冰廳','華苑酒家','新華茶餐廳','鮮瑤閣','太子酒家',
        '麥文記','滬上','港島南京','祥源餐廳']
print("eat_cn: ", len(eat_cn))

eat_kr = ['韓國城韓式料理','元朗金館','秀山韓國餐廳','弘大韓食','白石韓國餐廳','雲集韓國料理','韓滿屋韓式燒烤','韓味居','韓石館','華麗韓國餐廳','一心堂韓國料理','香港首家松鶴軒',
        '寶石韓國料理','牛滿屋','薩莉亞韓國料理','韓食堂','韓宮','喜膳韓國燒烤','河國榮韓國料理','韓樂屋','韓信韓式料理','陣陣香韓國料理','龍鳳韓國燒烤','韓泰屋韓國料理','明洞韓國燒烤',
        '韓威館','韓派','樂山','蘭芳園韓式料理','韓城小館','咖啡橙韓國料理','天香居韓國料理','一品韓國料理','豬足道','華宮韓國料理','白木屋','喜悅韓國料理','韓鄉村','爐峰韓國料理','韓香園',
        '韓食軒','巴韓','太極門韓國料理','金漢宮韓國燒烤','韓屋村','韓金廷','芝味韓國料理','韓寶宮']
print("eat_kr: ", len(eat_kr))

eat_jp = ['鳥居','鮨丸','松坂','大家樂和食','竹屋','田田屋','鮨一番','鐵板屋','廣重','和屋','壽司千','鯛一郎','壽司郎','鮮‧一番','金龍軒','一本廚房','龍門日本料理','鮨金剛',
        '漁梁居','金鮨壽司','壽司中','熊本屋','鮨文','米芝蓮壽司','早川','神戶屋','三崎日本料理','鮨室町','魚鮮丼','美登利壽司','魚生活','壽司正','鮨蔵','一燈日本料理',
        '一口福','魚肆一口','和民','壽司和','壽司之王','壽司多','清光園','鮨之霸','麵屋武藏','磯丸水產','鮨道','神戶屋日式鐵板燒','壽司鮮','壽司大','海真鮨','鮨九','懐石料理花鳥風月']
print("eat_jp: ", len(eat_jp))

eat_sea = ['蘭芳園','泰鴻','仁記越南美食','越南簡餐','峰泰','炭記泰國餐廳','茶餐廳越南小食','河內滷味','海南雞飯餐廳','薄多羅','金都泰國餐廳','越南餐廳','同福客棧','越南小食專門店',
        '海南雞飯專門店','檳城泰國美食館','蘭桂坊越南美食','龍皇越南美食','越南人美食','越南豆腐花美食','泰越美食專門店','越河越南美食','越食越愛','泰國雞飯餐廳','金不換泰國餐廳',
        '越南美食茶餐廳','黃金海岸泰國餐廳','越式小食專門店','越南河粉美食','泰皇泰國美食專門店','越南美食粉麵店','檳城茶餐廳','越式燒鵝美食','越南生牛肉美食','越南清湯牛肉美食',
        '越南河粉專門店','海南風味餐廳','越式包點專門店','越南美食湯粉專門店','越式糯米飯專門店','新寶島泰國美食','越南煲仔小菜專門店','越南小菜專門店','越南酸辣粉美食','越南青花魚米線專門店',
        '越南肉粽美食','越南蝦卷美食','樂越南美食','海南牛肉飯專門店','越南麵包美食']
print("eat_sea: ", len(eat_sea))

museum = ['香港歷史博物館','香港空間博物館','香港科學館','香港海事博物館','香港視覺藝術中心','香港文化博物館','香港漫畫及遊戲畫廊','香港藝術中心','香港電影資料館','香港工藝館',
        '香港兒童文學館','紫禁城文化展覽館','中央圖書館','香港博物館','香港文學館','香港演藝學院賽馬會綜藝館','葵青劇院']
print("museum: ", len(museum))

outdoor = ['龍脊','大帽山','鳳凰山','鹿頸','大東山','大帽山郊野公園','梅子嶺','蓮花山','青山','龍虎山郊野公園','船灣淡水湖','獅子山','鯉魚山','太平山','黑蚶山郊野公園',
        '紅磡海心公園','香港仔海傍公園','長洲風景区','東涌郊野公園','西貢郊野公園','釣魚翁','西貢漁村','九龍山郊野公園','吐露港','南涌','大浪灣海灘','赤徑',
        '大澳','塔門郊野公園','大東海岸']
print("outdoor: ", len(outdoor))

shopping = ['太古城中心','尖沙咀海港城','旺角朗豪坊','銅鑼灣時代廣場','荃灣美麗華商場','尖沙咀新世紀廣場','旺角新之城','銅鑼灣希慎廣場','旺角區皇宮','銅鑼灣崇光百貨',
        '尖沙咀K11','觀塘APM','荃灣荃新天地','尖沙咀海運中心','銅鑼灣SOGO','尖沙咀美麗華商場','旺角朗豪坊','銅鑼灣利舞臺廣場','銅鑼灣華人行','元朗YoHo',
        '旺角海庭道','旺角世紀廣場','銅鑼灣威盛商場','尖沙咀新港中心','旺角新城市廣場','銅鑼灣皇室堡','銅鑼灣崇光百貨']
print("shopping: ", len(shopping))

